## Staging: cognito
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
lambda.tf
```
**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 6 to add, 1 to change, 8 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                   NAME                                    |
|----------|---------------------------------------------------------------------------|
| delete   | `aws_iam_policy.lambda_s3`                                                |
|          | `aws_s3_object.cognito_email_sender_code`                                 |
| update   | `aws_cognito_user_pool.forms`                                             |
| recreate | `aws_cloudwatch_log_group.cognito_email_sender`                           |
|          | `aws_cloudwatch_log_group.cognito_pre_sign_up`                            |
|          | `aws_lambda_function.cognito_email_sender`                                |
|          | `aws_lambda_function.cognito_pre_sign_up`                                 |
|          | `aws_lambda_permission.allow_cognito_to_call_cognito_email_sender_lambda` |
|          | `aws_lambda_permission.allow_cognito_to_call_cognito_pre_sign_up_lambda`  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.cognito_email_sender must be replaced
-/+ resource "aws_cloudwatch_log_group" "cognito_email_sender" {
      ~ arn               = "arn:aws:logs:ca-central-1:687401027353:log-group:/aws/lambda/Cognito_Email_Sender" -> (known after apply)
      ~ id                = "/aws/lambda/Cognito_Email_Sender" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/lambda/Cognito_Email_Sender" -> "/aws/lambda/cognito-email-sender" # forces replacement
      + name_prefix       = (known after apply)
      - tags              = {} -> null
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.cognito_pre_sign_up must be replaced
-/+ resource "aws_cloudwatch_log_group" "cognito_pre_sign_up" {
      ~ arn               = "arn:aws:logs:ca-central-1:687401027353:log-group:/aws/lambda/Cognito_Pre_Sign_Up" -> (known after apply)
      ~ id                = "/aws/lambda/Cognito_Pre_Sign_Up" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/lambda/Cognito_Pre_Sign_Up" -> "/aws/lambda/cognito-pre-sign-up" # forces replacement
      + name_prefix       = (known after apply)
      - tags              = {} -> null
        # (4 unchanged attributes hidden)
    }

  # aws_cognito_user_pool.forms will be updated in-place
  ~ resource "aws_cognito_user_pool" "forms" {
        id                         = "ca-central-1_Cguq9JNQ1"
        name                       = "forms_user_pool"
        tags                       = {}
        # (13 unchanged attributes hidden)

      ~ lambda_config {
          ~ pre_sign_up = "arn:aws:lambda:ca-central-1:687401027353:function:Cognito_Pre_Sign_Up" -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ custom_email_sender {
              ~ lambda_arn     = "arn:aws:lambda:ca-central-1:687401027353:function:Cognito_Email_Sender" -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # aws_iam_policy.lambda_s3 will be destroyed
  # (because aws_iam_policy.lambda_s3 is not in configuration)
  - resource "aws_iam_policy" "lambda_s3" {
      - arn         = "arn:aws:iam::687401027353:policy/cognito_lambda_s3" -> null
      - description = "IAM policy for storing files in S3" -> null
      - id          = "arn:aws:iam::687401027353:policy/cognito_lambda_s3" -> null
      - name        = "cognito_lambda_s3" -> null
      - path        = "/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::forms-staging-lambda-code/*",
                          - "arn:aws:s3:::forms-staging-lambda-code",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPA2ADCLI4MTE2ZUSKZP" -> null
      - tags        = {} -> null
      - tags_all    = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
    }

  # aws_lambda_function.cognito_email_sender must be replaced
-/+ resource "aws_lambda_function" "cognito_email_sender" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ca-central-1:687401027353:function:Cognito_Email_Sender" -> (known after apply)
      ~ function_name                  = "Cognito_Email_Sender" -> "cognito-email-sender" # forces replacement
      - handler                        = "cognito_email_sender.handler" -> null
      ~ id                             = "Cognito_Email_Sender" -> (known after apply)
      + image_uri                      = ":latest"
      ~ invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:687401027353:function:Cognito_Email_Sender/invocations" -> (known after apply)
      ~ last_modified                  = "2024-01-12T15:09:29.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ package_type                   = "Zip" -> "Image" # forces replacement
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:687401027353:function:Cognito_Email_Sender:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:687401027353:function:Cognito_Email_Sender:$LATEST/invocations" -> (known after apply)
      - runtime                        = "nodejs18.x" -> null
      - s3_bucket                      = "forms-staging-lambda-code" -> null
      - s3_key                         = "cognito_email_sender_code" -> null
      - s3_object_version              = "pQng_9WlEDo1NcBrILhs20sbhfFBD1Oo" -> null
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "JQU+xOvCFaZHW/kdM3TnHxkFnJXz/ytxiRXLMJzpxF0=" -> (known after apply)
      ~ source_code_size               = 5346786 -> (known after apply)
      - tags                           = {} -> null
      ~ version                        = "$LATEST" -> (known after apply)
        # (7 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.cognito_pre_sign_up must be replaced
-/+ resource "aws_lambda_function" "cognito_pre_sign_up" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ca-central-1:687401027353:function:Cognito_Pre_Sign_Up" -> (known after apply)
      - filename                       = "/tmp/pre_sign_up_main.zip" -> null
      ~ function_name                  = "Cognito_Pre_Sign_Up" -> "cognito-pre-sign-up" # forces replacement
      - handler                        = "pre_sign_up.handler" -> null
      ~ id                             = "Cognito_Pre_Sign_Up" -> (known after apply)
      + image_uri                      = ":latest"
      ~ invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:687401027353:function:Cognito_Pre_Sign_Up/invocations" -> (known after apply)
      ~ last_modified                  = "2023-10-30T19:32:35.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ package_type                   = "Zip" -> "Image" # forces replacement
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:687401027353:function:Cognito_Pre_Sign_Up:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:687401027353:function:Cognito_Pre_Sign_Up:$LATEST/invocations" -> (known after apply)
      - runtime                        = "nodejs18.x" -> null
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "QTDI90Q+x/QfDnbowk26CzT+EGf4lzBQCRoJniGB88s=" -> (known after apply)
      ~ source_code_size               = 326 -> (known after apply)
      - tags                           = {} -> null
      ~ version                        = "$LATEST" -> (known after apply)
        # (7 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

        # (1 unchanged block hidden)
    }

  # aws_lambda_permission.allow_cognito_to_call_cognito_email_sender_lambda must be replaced
-/+ resource "aws_lambda_permission" "allow_cognito_to_call_cognito_email_sender_lambda" {
      ~ function_name       = "Cognito_Email_Sender" -> "cognito-email-sender" # forces replacement
      ~ id                  = "terraform-20230516185044900500000003" -> (known after apply)
      ~ statement_id        = "terraform-20230516185044900500000003" -> (known after apply)
      ~ statement_id_prefix = "terraform-" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_permission.allow_cognito_to_call_cognito_pre_sign_up_lambda must be replaced
-/+ resource "aws_lambda_permission" "allow_cognito_to_call_cognito_pre_sign_up_lambda" {
      ~ function_name       = "Cognito_Pre_Sign_Up" -> "cognito-pre-sign-up" # forces replacement
      ~ id                  = "terraform-20230607124925319100000001" -> (known after apply)
      ~ statement_id        = "terraform-20230607124925319100000001" -> (known after apply)
      ~ statement_id_prefix = "terraform-" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_s3_object.cognito_email_sender_code will be destroyed
  # (because aws_s3_object.cognito_email_sender_code is not in configuration)
  - resource "aws_s3_object" "cognito_email_sender_code" {
      - bucket                 = "forms-staging-lambda-code" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "binary/octet-stream" -> null
      - etag                   = "77b6abfcc32504965c9f28128c3bece9-2" -> null
      - force_destroy          = false -> null
      - id                     = "cognito_email_sender_code" -> null
      - key                    = "cognito_email_sender_code" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/tmp/cognito_email_sender.zip" -> null
      - source_hash            = "JQU+xOvCFaZHW/kdM3TnHxkFnJXz/ytxiRXLMJzpxF0=" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - version_id             = "pQng_9WlEDo1NcBrILhs20sbhfFBD1Oo" -> null
    }

Plan: 6 to add, 1 to change, 8 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.cognito_email_sender"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.cognito_pre_sign_up"]
WARN - plan.json - main - Missing Common Tags: ["aws_cognito_user_pool.forms"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.cognito_lambda_kms"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.cognito_lambda_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.cognito_lambda_secrets"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.cognito_userpool_import_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.cognito_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.cognito_userpool_import"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.cognito_encryption"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.cognito_email_sender"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.cognito_pre_sign_up"]

31 tests, 19 passed, 12 warnings, 0 failures, 0 exceptions

```

</details>
